### Forest Lotus Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.lotus-calibnet.data.digitalocean_project.forest_project: Reading...
module.lotus-calibnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=e39f12bf-15a1-11ee-9a05-0a58ac14d046]
module.lotus-calibnet.data.digitalocean_ssh_keys.keys: Reading...
module.lotus-calibnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.lotus-calibnet.digitalocean_droplet.forest: Refreshing state... [id=362695295]
module.lotus-calibnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=362695295-e39f12bf-15a1-11ee-9a05-0a58ac14d046-20230628151551393400000001]
module.lotus-calibnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=251f587d-da11-4326-aaf9-efe849e2959f]
module.lotus-calibnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.lotus-calibnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lotus-calibnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-06-28T15:14:26Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "362695295" -> (known after apply)
      ~ ipv4_address         = "138.68.74.9" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.11" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "lotus"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:362695295" -> (known after apply)
      ~ user_data            = "d07f7676c1d46558e900fdd5ab749525d8836fc8" -> "4d057dc0590aac3aafc129ad7a2ad143e931b6e2" # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [
          - "e39f12bf-15a1-11ee-9a05-0a58ac14d046",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lotus-calibnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 362695295,
        ] -> (known after apply)
        id              = "251f587d-da11-4326-aaf9-efe849e2959f"
        name            = "mainnet-calibnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lotus-calibnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:362695295",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lotus-calibnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 362695295 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "362695295-e39f12bf-15a1-11ee-9a05-0a58ac14d046-20230628151551393400000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>